In [1]:
import pandas as pd

In [2]:
df = pd.read_excel(r"Z:\Downloads\LOTR 1.xlsx")
df

  FirstName  Age
0     Frodo   50
1   Samwise   39
2   Legolas   29
3    Elrond   65
4  Barromir   51
5       jon   33
6     baris   34
7       jon   35

In [3]:
df1 = pd.read_excel(r"Z:\Downloads\LOTR 2.xlsx")
df1

  FirstName  Age
0     Frodo   50
1   Samwise   39
2     amira   33
3   Legolas   29
4    Elrond   65
5  Barromir   51
6     malek   13
7     yamen   12
8     malek   13
9      Ramy   40

In [5]:
df1.merge(df,how = 'outer')

   FirstName  Age
0   Barromir   51
1     Elrond   65
2      Frodo   50
3    Legolas   29
4       Ramy   40
5    Samwise   39
6      amira   33
7      baris   34
8        jon   33
9        jon   35
10     malek   13
11     malek   13
12     yamen   12